src/cf/Enums/инт_СтатусыИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_СтатусыИсходящихСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаФормирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/инт_СтатусыИсходящихСообщений/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////

// инт_СтатусыИсходящихСообщений

//  

////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Это ошибочный статус
//
// Параметры:
//  Статус     -  ПеречислениеСсылка.инт_СтатусыИсходящихСообщений -  Ссылка на проверяемый статус.
// 
// Возвращаемое значение:
//  Булево - Истина, если статус относится к ошибочным и Ложь, если нет. 
//
Функция ЭтоОшибочныйСтатус(Статус) Экспорт
	МассивОшибочныхСтатусов = Новый Массив;
    МассивОшибочныхСтатусов.Добавить(Перечисления.инт_СтатусыИсходящихСообщений.ОшибкаОтправки);
    МассивОшибочныхСтатусов.Добавить(Перечисления.инт_СтатусыИсходящихСообщений.ОшибкаФормирования);
    
    Возврат Не МассивОшибочныхСтатусов.Найти(Статус) = Неопределено;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
